{
    "entries": [
        {
            "id": "nlp",
            "title": "Analyzing attention in online health forums",
            "text": "After taking her natural language processing class,  Professor Lu Xiao invited me to assist in her research on information sharing and digital humanities. The project started by scraping Reddit data as a favor to another research team, but  evolved into a deeper analysis of the collected data. I ended up authoring and submitting a paper to iConference 2021, which explores linguistic, topic, and sentiment features of posts and comments in health subreddits. The features were also analyzed for correlation with popularity and interaction measures to draw conclusions about human behavior within the subreddits.",
            "imageName": "n-grams.png",
            "imageAltText": "word clouds showing unigrams and bigrams in r/dementia and r/Alzheimers",
            "imageRight": "",
            "link": "https://doi.org/10.1007/978-3-030-71292-1_29"
        },
        {
            "id": "bioinformatics",
            "title": "Modeling chromatin accessibility from time series data",
            "text": "The goal of this research group was to infer gene regulatory networks formed by various events, to aid in medical research. I entered the research group at the beginning of the project, so I spent my final semester doing preliminary analysis of sample datasets. As a part of the group's collaboration with the biology department, a dataset was being generated specifically for this project. The datasets showed levels of various proteins in the cell over time. My objective was to model chromatin accessibility, which is just one factor in gene expression and regulatory network dynamics. The main findings of this research were that gradient descent may be an effective approach to the problem and that the next avenue of investigation should be to incorporate more information reflecting the gene expression process into the cost function.",
            "imageName": "chromatin-accessibility.webp",
            "imageAltText": "levels of compaction in DNA",
            "imageRight": "true",
            "link": "https://github.com/o-flynn/o-flynn.github.io/tree/main/src/Resources/gene-accessibility-atac-seq.pdf"
        },
        {
            "id": "hungarian-alg",
            "title": "A better spectrum allocation algorithm",
            "text": "To finish off my Honors degree, I assisted Dr. Biao Chen in his research on wireless communications. The topic of my project was the radio frequency spectrum, and how segments of it are allocated among many devices. I improved upon the generally used approach, called sequential allocation, by fitting the problem of spectrum allocation into a fundamental optimization problem. Then, I adapted the solution algorithm to the context of our problem and ran it with some simulated allocation scenarios to compare it with sequential allocation. My algorithm was 25-35% more efficient in terms of data transmission volume, but had a greater time complexity than sequential allocation.",
            "imageName": "assignment-problem.png",
            "imageAltText": "adapting the assignment problem to spectrum allocation",
            "imageRight": "",
            "link": "https://files.emailmeform.com/742180/mYolRcgI/Olivia%20A.%20Flynn%20Honors%20Thesis.pdf"
        },
        {
            "id": "cusehacks",
            "title": "Establishing CuseHacks at Syracuse University",
            "text": "During my sophomore year, I was looking to get more involved on campus, so I joined the organizing effort for Cusehacks 2018-- the first ever hackathon at Syracuse University. It wasn't until the next school year that I realized all of the organizers had graduated, except for me and two other underclassmen. It was up to us to make sure that CuseHacks continued and became established as an annual event. We scrambled to get permissions from the school, book rooms, arrange meals/snacks, negotiate corporate sponsorships, plan workshops, and of course, advertise the event. It was an intense few months, but in the end CuseHacks lived to see another year.\n\nMy job was to reach out for sponsorships and run organizer meetings for the small group we had recruited. This was definitely out of my comfort zone at the time, but it was critical to developing the sense of leadership and initiative that I have today. As my graduation date grew closer, I made sure to document as much as possible and formalize the organizer recruiting process to give CuseHacks the best chance of continuing after I was gone. Apparently, I was successful in this-- the other two leaders and I have all graduated now, but participation in CuseHacks is continuing to grow year after year.",
            "imageName": "cusehacks.jpeg",
            "imageAltText": "hackers participating in CuseHacks",
            "imageRight": "true",
            "link": "https://innovateorange.github.io/cusehacks/"
        },
        {
            "id": "aoe-secretary",
            "title": "Establishing e-voting in A.Ω.E. STEM sorority",
            "text": "In my effort to become more involved in campus activities and expand my network, I joined Alpha Omega Epsilon: a professional STEM sorority that brings women together across disciplines and grades. The thing I most enjoyed was meeting older students in the same major as me. Even though there were only two, I was happy to have some role models. Eventually I decided to run for an executive position and was elected as Secretary, based on my organizational skills shown in the classroom and in planning CuseHacks.\n\nMy responsibilities were to take attendance and notes during our weekly chapter meetings, but my main initiative during the term was to implement e-voting. Previously, votes were conducted through a blind raise of hands that was hand-counted by the President and VP. It took a **very** long time, causing vote-heavy meetings (e.g. elections) to become quite grueling. The solution was surprisingly simple: create a few templates on Google Forms for different types of voting situations. After pitching and demonstrating this method of e-voting to the rest of the executive board, it was adopted by the sorority.",
            "imageName": "aoe-1.jpeg",
            "imageAltText": "Alpha omega epsilon emblem",
            "imageRight": "",
            "link": "https://aoepsln.wixsite.com/zeta"
        },
        {
            "id": "ra",
            "title": "Resident Advisor to the Engineering Learning Community",
            "text": "During my first year at Syracuse University, I was part of the Engineering Learning Community: several floors of a dorm building solely populated by freshman engineering students. This environment was great for meeting friends outside of my major, and definitely made group study easier. Once I learned how expensive housing was, I applied to be a Residential Advisor and was placed in the very same community. My work there went beyond enforcing dorm rules and handling issues between roommates. I did my best to be a resource, mentor, or friend to any resident that wanted it. Most commonly, I helped by suggesting clubs and campus services related to the residents' interests, sharing my experience/strategies within computer science, and generally helping the newly independent students to \"adult\". \n\nWithin the learning community, we also organized engineering-oriented activities, like museum trips and documentary/movie viewing parties. However, I had some more interactive ones in mind, like a Women in STEM panel featuring professors and leaders of student organizations or hosting \"lightning talks\" presented by research professors who were willing to let a freshman shadow or assist in their work. I was a large proponent of increasing exposure of the student body to the research happening at the school. In my opinion, research is a wonderful and interesting way to get practical experience in between or in place of an internship, but the way to get there was not common knowledge at my school.",
            "imageName": "ra.png",
            "imageAltText": "resident advisors at an orientation event",
            "imageRight": "true",
            "link": ""
        },
        {
            "id": "awards",
            "title": "Academic honors and awards",
            "text": "My philosophy is to always do my best inside and outside of the classroom, and this has been recognized across my collegiate career. First, I was admitted to the Honors College at my university and graduated with an Honors degree. During my freshman year, I was selected as a Donofrio Scholar along with 9 others in my grade, which guaranteed me an internship that summer. With a GPA of 3.99, I graduated *summa cum laude* and landed on the Dean's List every semester. Upon completion of my Bachelor's degree, I was granted the Warren Semon Award for \"establishing an exceptional scholastic record\". A year later when I finished my Master's degree, I was also awarded the title of \"Outstanding Graduate Student in Computer Science\" by my department.",
            "imageName": "su-emblem.jpeg",
            "imageAltText": "syracuse university emblem",
            "imageRight": "",
            "link": ""
        },
        {
            "id": "teaching",
            "title": "Learning through teaching",
            "text": "Along my college journey, I had the opportunity to teach and advise so many friends and younger students. I spent one semester as a TA for our college's intro coding course but beyond that, I simply enjoyed the feeling of helping others to understand concepts that they struggled with or had missed out on in class. I was very conscious of the way I explained things, because I did not want to be patronizing, but also didn't want to assume that they understood every background concept needed for the topic at hand-- sometimes there is just one missing piece needed to complete the picture. This definitely honed my interpersonal skills and ability to articulate my thoughts on complex subjects. It also made me realize that I enjoy sharing and reinforcing my knowledge through teaching.",
            "imageName": "brain-cycle.jpeg",
            "imageAltText": "brain with arrows circling",
            "imageRight": "true",
            "link": ""
        }
    ]
}