{
    "imageName": "headshot.png",
    "altText": "headshot of olivia flynn",
    "text": "Outside of work, my main hobby is playing music and I currently play bass guitar in a band called [Cottage Corpse](https://youtu.be/Ta7j0G7xA6s?t=3089). It's been a very engaging experience to go from forming the band about a year ago, to playing several shows every month. Along the way, I've had so much fun writing music, managing social media, and designing promotional material. While I've only been playing bass for about a year and a half, my prior music experience gave me the confidence to get on stage right away. Before college, I had played flute in classical wind ensembles for seven years and marching band percussion for three. This hobby has severed me well, providing my first leadership roles and fostering independence. I even joined the [Seattle Cascades Drum and Bugle Corps](https://youtu.be/-6EI54Z3BtY?t=5) on their nationwide tour in the summer of 2016-- a formative experience where giving up was certainly not an option.\n\nAnother lasting interest of mine is nature and life in general, fostered by the variety of landscapes that surrounded me growing up. I was fascinated by all types of animals: the neighborhood cats, sea life that I observed in  tide pools, and even insects. Eventually I realized that other types of organisms like plants and fungi were just as lively and interesting in their own ways, which led me to my first burning scientific question: how did it all begin? It turns out that the answer is already known, and it's [hydrothermal vents](https://www.nature.com/articles/nrmicro1991). In time, I went back to the drawing board and came up with a new ultimate question that still occupies me today: how could I even contemplate that? Thus, my interest in cognitive science began.\n\nWith my beginnings as a quiet and standoffish kid, the cognition of others was always a mystery to me-- I just did not understand how other people could think of so many things to chat about. It wasn't until college, when I was studying computer science, that I learned cognitive science existed. The interdisciplinary aspect seemed so perfect for me, combining psychology, computer science, neuroscience, and more. Now, I'm interested in applying psychological principles to technology in order to augment and enhance the human experience. For example, smartphones had a huge impact on our behavior and thinking, adding new mediums of communication and putting the power of the internet into our hands. What's going to be the next smartphone? My guess is that augmented reality could make our experience of technology even more seamless, especially if we leverage the boon of data being generated by the IoT.\n\nMy path to studying computer science is a relatively boring story compared to the ones above. I simply did not know what I wanted to study after high school, so I picked CS to try first and happened to have a knack for it. Over the course of my education and career, I've certainly grown to love the challenge of logical, yet creative, problem solving and the endless possibilities of what can be built."
}