{
    "imageName": "headshot.png",
    "altText": "image of an image",
    "text": "My main hobby is playing music. I currently play bass guitar in  a band called Cottage Corpse. As one of the founding members, it has been a very engaging experience to go from forming the band with our singer-songwriter, to writing my own bass parts, recruiting additional band members, and finally booking our first gigs. The band also provides me a create outlet in the form of designing logos, posters, merch, and creating content for our social media. All of this happened within my first year of learning bass, which seems like a very fast progression, but it was made possible by my prior music experience. Beginning in middle school, I played flute in the school band. I continued through high school for a total of seven years, and also picked up the marimba in my final two years of high school in the marching band. I was put in charge of the front ensemble (which includes marimba), marking my  first real leadership experience. My responsibility and dedication to marimba paid off when I auditioned and got contracted to join the Seattle Cascades Drum and Bugle Corps on their nationwide tour in the summer of 2016. It was a formative experience; when rehearsing all day in the summer heat, hundreds of miles from home, giving up or being unable play your parts accurately was not an option. This boosted my drive to succeed in anything I put my mind to-- a sentiment I carried through my college years and to the present day.\n\nComputer science was never a salient topic in my upbringing and I only learned how to code in my first college class, despite both of my parents being software engineers. When I entered college, I was only trying it out-- I didn't know what I wanted to do after graduating highschool and I figured my parents could help me with the subject if I needed it. But I never did, even years after deciding to stick with the major. I just had a knack for it! My theory is that the constant presence of computer science in the background and peripheries of my childhood had subliminally influenced me to think in a way that lends itself to soling those types of problems.\n\nThough I decided to pursue a career in computer science, my interest in biology stuck around. It was a much larger part of my life, supported by the lively natural areas that surrounded me growing up. I was fascinated by all types of animals: the neighborhood cats, sea life that I observed in the tide pools of the Oregon coast, and even insects. Eventually I realized that other types of organisms like plants and fungi were just as lively in their own ways. This led me to the first big question that I could see myself pursuing as a career: how did it all begin? Well, it turns out that the answer is already known, and it's hydrothermal vents. In time, I went back to the drawing board and came up with a new ultimate question that's still occupying me today: how could I even contemplate that? And thus, my interest in cognitive science came to be.\n\nMy story here started with psychology classes and hours of googling random questions about how people think. I had always been quiet and standoffish, largely because I did not understand how other people thought of so many things to talk about, so this was a natural curiosity for me. College is when I actually learned that cognitive science existed. The interdisciplinary aspect seemed so perfect for me, combining psychology, computer science, and  more interesting fields as well. Now I'm interested in how psychological principles can be applied to technology in order to further augment the human experience. For example, smartphones had a huge impact on our behavior and thinking, adding many new mediums of communication and putting the power of the internet into our hands. What's going to be the next smartphone? My guess is that augmented reality could make the experience of a smartphone even more seamless."
}